app/controllers/companies_controller.rb

SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
def show
@company=Company.find(params[:id])

INSERT INTO "companies" ("name", "created_at", "updated_at", "companyEmail") VALUES (?, ?, ?, ?)  [["name", "e"], ["created_at", 2017-04-20 13:47:17 UTC], ["updated_at", 2017-04-20 13:47:17 UTC], ["companyEmail", "d"]]
---
  def create
  @company = Company.new(company_params)

	if @company.save