app/controllers/jobs_controller.rb

SELECT  "students".* FROM "students" ORDER BY "students"."id" ASC LIMIT ?  [["LIMIT", 1]]
---
   def create
	 @job = Job.new(job_params)

		if @job.valid?

			#attempted to allow the option to attach a file to the email, but was unable to. There are limited resources out there that try to explain how to do it but none were sufficient for this scenario.
			 #UserMailer.jobRequest_email(@job, Student.first, params[:attachment].read, params[:attachment].original_filename).deliver
			 Student.all.each do |student|