app/controllers/students_controller.rb

def show
#@student=Student.find_by_email(params[:email])
@student=Student.find(params[:id])
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
  @student = Student.new(student_params)

	if @student.save
---
INSERT INTO "students" ("email", "firstName", "lastName", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", "ngrace17@jcu.edu"], ["firstName", "Nick"], ["lastName", "Grace"], ["password", "sparky00"], ["created_at", 2017-04-21 22:44:57 UTC], ["updated_at", 2017-04-21 22:44:57 UTC]]